In [1]:
import pandas as pd
from numpy import nan as na
import numpy as np

In [2]:
dict1 = {"names"  : ["ayesha", "ariba","alishba","hamza" ],"age" : [21,19,18,14],"qualifiction":[na,"inter","inter","matric"]}
dict1

{'names': ['ayesha', 'ariba', 'alishba', 'hamza'],
 'age': [21, 19, 18, 14],
 'qualifiction': [nan, 'inter', 'inter', 'matric']}

In [3]:
series1 = pd.Series([1,2,3,4,9,8,6,4])
series1

0    1
1    2
2    3
3    4
4    9
5    8
6    6
7    4
dtype: int64

In [4]:
df1 = pd.DataFrame(dict1,index = [1,2,3,4])
df1

     names  age qualifiction
1   ayesha   21          NaN
2    ariba   19        inter
3  alishba   18        inter
4    hamza   14       matric

In [5]:
df1.values

array([['ayesha', 21, nan],
       ['ariba', 19, 'inter'],
       ['alishba', 18, 'inter'],
       ['hamza', 14, 'matric']], dtype=object)

In [6]:
df1.index

Int64Index([1, 2, 3, 4], dtype='int64')

In [7]:
series1[0]

1

In [8]:
series1[[6,5,4]]

6    6
5    8
4    9
dtype: int64

In [9]:
series1[series1>2]

2    3
3    4
4    9
5    8
6    6
7    4
dtype: int64

In [10]:
series1

0    1
1    2
2    3
3    4
4    9
5    8
6    6
7    4
dtype: int64

In [11]:
8 in series1

False

In [12]:
series2 = pd.Series(dict1)
series2

names           [ayesha, ariba, alishba, hamza]
age                            [21, 19, 18, 14]
qualifiction        [nan, inter, inter, matric]
dtype: object

In [13]:
series3 = pd.Series([3,3,4,5,6,8,9,9])
series3+series1

0     4
1     5
2     7
3     9
4    15
5    16
6    15
7    13
dtype: int64

In [14]:
series1.name = "child"
series1.index.name = "children"
series1

children
0    1
1    2
2    3
3    4
4    9
5    8
6    6
7    4
Name: child, dtype: int64

In [15]:
df2  =  pd.DataFrame(dict1, columns = ["age","qualifiction","names"])
df2

   age qualifiction    names
0   21          NaN   ayesha
1   19        inter    ariba
2   18        inter  alishba
3   14       matric    hamza

In [16]:
data = pd.read_csv("PGYVqA.csv")
data.head()

,Student Code,Degree,Student Name,Mid,Quiz 1,Quiz 2,Best of Quizzes,Assignment 1,Assignment 2,Best of Assignments,Total Sessional (50),Final (50),Total (100),Grade
0,022-14-19987,BS(CS),Abdul Basit,28,8.0,3.0,8,7.0,9.0,9,45,25.0,70,B
1,022-14-110233,BS(CS),Adeel Ahmed,17,NaN,5.0,5,8.0,10.0,10,32,18.0,50,F
2,022-14-110585,BS(CS),Afrah Zareen,18,5.0,2.0,5,8.0,10.0,10,33,30.0,63,C
3,022-14-19718,BS(CS),Ahmed Ali Raza,14,7.0,2.0,7,NaN,2.0,2,23,23.0,46,F
4,022-14-110648,BS(CS),Ahsan Ali Vohra,27,7.0,6.0,7,7.0,9.0,9,43,34.0,77,B

In [17]:
len(data.columns)

14

In [18]:
data["Student Name"].head()      #columns

0        Abdul Basit
1        Adeel Ahmed
2       Afrah Zareen
3     Ahmed Ali Raza
4    Ahsan Ali Vohra
Name: Student Name, dtype: object

In [19]:
data.loc[1]  #index

Student Code            022-14-110233
Degree                         BS(CS)
Student Name              Adeel Ahmed
Mid                                17
Quiz 1                            NaN
Quiz 2                              5
Best of Quizzes                     5
Assignment 1                        8
Assignment 2                       10
Best of Assignments                10
Total Sessional (50)               32
Final (50)                         18
Total (100)                        50
Grade                               F
Name: 1, dtype: object

In [20]:
data.Mid

0     28
1     17
2     18
3     14
4     27
5     25
6     28
7     26
8     19
9     28
10    30
11    28
12    23
13    24
14    21
15    18
16    23
17    20
18    16
19    27
20    24
21    20
22    20
23    26
24    28
25    26
26    27
27    27
28    22
29    17
30    23
31    27
32     9
33    20
34    25
35    20
36    25
37    27
38     9
39    28
40    27
41    20
42    28
43    28
44    25
45    27
46    25
47    11
Name: Mid, dtype: int64

In [21]:
data.loc[1]

Student Code            022-14-110233
Degree                         BS(CS)
Student Name              Adeel Ahmed
Mid                                17
Quiz 1                            NaN
Quiz 2                              5
Best of Quizzes                     5
Assignment 1                        8
Assignment 2                       10
Best of Assignments                10
Total Sessional (50)               32
Final (50)                         18
Total (100)                        50
Grade                               F
Name: 1, dtype: object

In [22]:
df1.fillna("undergrad",inplace = True)

In [23]:
df1["undergraduate"] = df1["qualifiction"] == "undergrad"
df1

     names  age qualifiction  undergraduate
1   ayesha   21    undergrad           True
2    ariba   19        inter          False
3  alishba   18        inter          False
4    hamza   14       matric          False

In [24]:
del df1["undergraduate"]
df1

     names  age qualifiction
1   ayesha   21    undergrad
2    ariba   19        inter
3  alishba   18        inter
4    hamza   14       matric

In [25]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [26]:
df2 = pd.DataFrame(pop)
df2

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [27]:

df2.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [28]:
df1.T

                      1      2        3       4
names            ayesha  ariba  alishba   hamza
age                  21     19       18      14
qualifiction  undergrad  inter    inter  matric

In [29]:
df1.values

array([['ayesha', 21, 'undergrad'],
       ['ariba', 19, 'inter'],
       ['alishba', 18, 'inter'],
       ['hamza', 14, 'matric']], dtype=object)

         reindexing

In [30]:
series1.name = "a"
series1.index.name = "s"
series1

s
0    1
1    2
2    3
3    4
4    9
5    8
6    6
7    4
Name: a, dtype: int64

In [31]:
df1

     names  age qualifiction
1   ayesha   21    undergrad
2    ariba   19        inter
3  alishba   18        inter
4    hamza   14       matric

In [32]:
"names" in df1.columns

True

In [33]:
df1.reindex([4,3,2,1,0])
df1

     names  age qualifiction
1   ayesha   21    undergrad
2    ariba   19        inter
3  alishba   18        inter
4    hamza   14       matric

In [41]:
series1.drop([6,3])

s
0    1
1    2
2    3
4    9
5    8
7    4
Name: a, dtype: int64